In [1]:
import numpy as np
import pandas as pd

### Creating Series

In [2]:
s = pd.Series([1, 2, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    2.0
2    3.0
3    5.0
4    NaN
5    6.0
6    8.0
dtype: float64

### Creating a DataFrame

In [4]:
dates = pd.date_range('20130101', periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.197528 -0.940126 -0.948381  1.709425
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-03 -0.143707  0.853014  0.207650 -0.163980
2013-01-04 -0.422329 -0.987882  2.559101  0.978294
2013-01-05 -0.318623  0.787998 -0.932429 -0.209527
2013-01-06  0.088719 -0.644289 -0.810996 -1.076429

In [7]:
df2 = pd.DataFrame({
    'A': 1,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(['test', 'train', 'test', 'train']),
    'F': 'foo'
})

In [8]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.head()

                   A         B         C         D
2013-01-01  0.197528 -0.940126 -0.948381  1.709425
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-03 -0.143707  0.853014  0.207650 -0.163980
2013-01-04 -0.422329 -0.987882  2.559101  0.978294
2013-01-05 -0.318623  0.787998 -0.932429 -0.209527

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
# df.to_numpy(2)
df

                   A         B         C         D
2013-01-01  0.197528 -0.940126 -0.948381  1.709425
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-03 -0.143707  0.853014  0.207650 -0.163980
2013-01-04 -0.422329 -0.987882  2.559101  0.978294
2013-01-05 -0.318623  0.787998 -0.932429 -0.209527
2013-01-06  0.088719 -0.644289 -0.810996 -1.076429

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.127266 -0.257869  0.055289  0.118332
std    0.235596  0.848978  1.346572  1.029877
min   -0.422329 -0.987882 -0.948381 -1.076429
25%   -0.280264 -0.866167 -0.902070 -0.448226
50%   -0.154447 -0.630110 -0.301673 -0.186753
75%    0.030612  0.437016  0.244502  0.692726
max    0.197528  0.853014  2.559101  1.709425

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.197528   -0.165188   -0.143707   -0.422329   -0.318623    0.088719
B   -0.940126   -0.615931    0.853014   -0.987882    0.787998   -0.644289
C   -0.948381    0.256786    0.207650    2.559101   -0.932429   -0.810996
D    1.709425   -0.527792   -0.163980    0.978294   -0.209527   -1.076429

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.709425 -0.948381 -0.940126  0.197528
2013-01-02 -0.527792  0.256786 -0.615931 -0.165188
2013-01-03 -0.163980  0.207650  0.853014 -0.143707
2013-01-04  0.978294  2.559101 -0.987882 -0.422329
2013-01-05 -0.209527 -0.932429  0.787998 -0.318623
2013-01-06 -1.076429 -0.810996 -0.644289  0.088719

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.422329 -0.987882  2.559101  0.978294
2013-01-01  0.197528 -0.940126 -0.948381  1.709425
2013-01-06  0.088719 -0.644289 -0.810996 -1.076429
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-05 -0.318623  0.787998 -0.932429 -0.209527
2013-01-03 -0.143707  0.853014  0.207650 -0.163980

In [25]:
df[0:3]

                   A         B         C         D
2013-01-01  0.197528 -0.940126 -0.948381  1.709425
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-03 -0.143707  0.853014  0.207650 -0.163980

In [26]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-03 -0.143707  0.853014  0.207650 -0.163980
2013-01-04 -0.422329 -0.987882  2.559101  0.978294

In [27]:
df.loc[dates[0]]

A    0.197528
B   -0.940126
C   -0.948381
D    1.709425
Name: 2013-01-01 00:00:00, dtype: float64

In [28]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.197528 -0.940126
2013-01-02 -0.165188 -0.615931
2013-01-03 -0.143707  0.853014
2013-01-04 -0.422329 -0.987882
2013-01-05 -0.318623  0.787998
2013-01-06  0.088719 -0.644289

In [29]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.165188 -0.615931
2013-01-03 -0.143707  0.853014
2013-01-04 -0.422329 -0.987882

In [30]:
df.loc['20130102', ['A', 'B']]

A   -0.165188
B   -0.615931
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.at[dates[0], 'A']

0.19752836007305954

In [32]:
df.iloc[3]

A   -0.422329
B   -0.987882
C    2.559101
D    0.978294
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.422329 -0.987882
2013-01-05 -0.318623  0.787998

In [34]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.165188  0.256786
2013-01-03 -0.143707  0.207650
2013-01-05 -0.318623 -0.932429

In [36]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792
2013-01-03 -0.143707  0.853014  0.207650 -0.163980

In [37]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.940126 -0.948381
2013-01-02 -0.615931  0.256786
2013-01-03  0.853014  0.207650
2013-01-04 -0.987882  2.559101
2013-01-05  0.787998 -0.932429
2013-01-06 -0.644289 -0.810996

In [38]:
df.iloc[1,1]

-0.6159305737575359

In [39]:
df.iat[1,1]

-0.6159305737575359

In [40]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.197528 -0.940126 -0.948381  1.709425
2013-01-06  0.088719 -0.644289 -0.810996 -1.076429

In [41]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.197528       NaN       NaN  1.709425
2013-01-02       NaN       NaN  0.256786       NaN
2013-01-03       NaN  0.853014  0.207650       NaN
2013-01-04       NaN       NaN  2.559101  0.978294
2013-01-05       NaN  0.787998       NaN       NaN
2013-01-06  0.088719       NaN       NaN       NaN

In [42]:
df2 = df.copy()

In [43]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [45]:
df2

                   A         B         C         D      E
2013-01-01  0.197528 -0.940126 -0.948381  1.709425    one
2013-01-02 -0.165188 -0.615931  0.256786 -0.527792    one
2013-01-03 -0.143707  0.853014  0.207650 -0.163980    two
2013-01-04 -0.422329 -0.987882  2.559101  0.978294  three
2013-01-05 -0.318623  0.787998 -0.932429 -0.209527   four
2013-01-06  0.088719 -0.644289 -0.810996 -1.076429  three

In [50]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.143707  0.853014  0.207650 -0.163980   two
2013-01-05 -0.318623  0.787998 -0.932429 -0.209527  four

In [51]:
sl = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [52]:
sl

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [53]:
df.at[dates[0], 'A'] = 0

In [54]:
df.iat[0,1] = 0

In [55]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [56]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.948381  5
2013-01-02 -0.165188 -0.615931  0.256786  5
2013-01-03 -0.143707  0.853014  0.207650  5
2013-01-04 -0.422329 -0.987882  2.559101  5
2013-01-05 -0.318623  0.787998 -0.932429  5
2013-01-06  0.088719 -0.644289 -0.810996  5

In [57]:
df2 = df.copy()

In [58]:
df2[df2 > 0] = -df2

In [59]:
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.948381 -5
2013-01-02 -0.165188 -0.615931 -0.256786 -5
2013-01-03 -0.143707 -0.853014 -0.207650 -5
2013-01-04 -0.422329 -0.987882 -2.559101 -5
2013-01-05 -0.318623 -0.787998 -0.932429 -5
2013-01-06 -0.088719 -0.644289 -0.810996 -5

In [60]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [61]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [62]:
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.948381  5  1.0
2013-01-02 -0.165188 -0.615931  0.256786  5  1.0
2013-01-03 -0.143707  0.853014  0.207650  5  NaN
2013-01-04 -0.422329 -0.987882  2.559101  5  NaN

In [63]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.948381  5  1.0
2013-01-02 -0.165188 -0.615931  0.256786  5  1.0

In [64]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.948381  5  1.0
2013-01-02 -0.165188 -0.615931  0.256786  5  1.0
2013-01-03 -0.143707  0.853014  0.207650  5  5.0
2013-01-04 -0.422329 -0.987882  2.559101  5  5.0

In [67]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [68]:
df.mean()

A   -0.160188
B   -0.101181
C    0.055289
D    5.000000
dtype: float64

df.mean(1)

In [69]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [70]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [71]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.143707 -0.146986 -0.792350  4.0
2013-01-04 -3.422329 -3.987882 -0.440899  2.0
2013-01-05 -5.318623 -4.212002 -5.932429  0.0
2013-01-06       NaN       NaN       NaN  NaN

In [72]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000 -0.948381   5
2013-01-02 -0.165188 -0.615931 -0.691595  10
2013-01-03 -0.308895  0.237084 -0.483944  15
2013-01-04 -0.731223 -0.750798  2.075157  20
2013-01-05 -1.049846  0.037200  1.142728  25
2013-01-06 -0.961127 -0.607089  0.331732  30

In [73]:
df.apply(lambda x: x.max() - x.min())

A    0.511048
B    1.840896
C    3.507483
D    0.000000
dtype: float64

In [74]:
s = pd.Series(np.random.randint(0,7, size=10))

In [75]:
s

0    3
1    5
2    3
3    5
4    3
5    2
6    3
7    3
8    1
9    0
dtype: int64

In [76]:
s.value_counts()

3    5
5    2
2    1
1    1
0    1
dtype: int64

In [77]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'Caba', 'dog', 'cat'])

In [78]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [83]:
8

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.948381  5
2013-01-02 -0.165188 -0.615931  0.256786  5
2013-01-03 -0.143707  0.853014  0.207650  5
2013-01-04 -0.422329 -0.987882  2.559101  5
2013-01-05 -0.318623  0.787998 -0.932429  5

In [84]:
df = pd.DataFrame(np.random.randn(10, 4))

In [85]:
df

          0         1         2         3
0 -0.096982 -2.199572 -1.966231  0.062704
1 -0.433885  0.692569  1.122215 -0.903336
2 -0.763499  1.091317  0.477364  0.340296
3 -0.156570 -0.153527  0.296886  0.317610
4  0.222769  0.327990  1.246990  1.544664
5  0.939489 -0.993433  0.721369 -0.070037
6 -1.190076 -0.260311 -0.220561 -0.515138
7  0.298146  1.073610  1.216822  0.165686
8 -2.072933 -0.903149  0.255653  1.721278
9  2.836297  1.867871 -0.209905  0.428722

In [86]:
pieces = [df[:3], df[3:7], df[7:]]

In [87]:
pd.concat(pieces)

          0         1         2         3
0 -0.096982 -2.199572 -1.966231  0.062704
1 -0.433885  0.692569  1.122215 -0.903336
2 -0.763499  1.091317  0.477364  0.340296
3 -0.156570 -0.153527  0.296886  0.317610
4  0.222769  0.327990  1.246990  1.544664
5  0.939489 -0.993433  0.721369 -0.070037
6 -1.190076 -0.260311 -0.220561 -0.515138
7  0.298146  1.073610  1.216822  0.165686
8 -2.072933 -0.903149  0.255653  1.721278
9  2.836297  1.867871 -0.209905  0.428722

In [88]:
left = pd.DataFrame({
    'key': ['foo', 'foo'],
    'lval': [1, 2]
})

In [89]:
right = pd.DataFrame({
    'key': ['foo', 'foo'],
    'rval': [4, 5]
})

In [90]:
left

   key  lval
0  foo     1
1  foo     2

In [91]:
right

   key  rval
0  foo     4
1  foo     5

In [92]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [93]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [94]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [95]:
left

   key  lval
0  foo     1
1  bar     2

In [96]:
right

   key  rval
0  foo     4
1  bar     5

In [97]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [98]:
df

          A         B         C         D
0 -0.446794 -1.072924  0.583519  0.283610
1 -0.626668 -0.545055  0.083178  1.167317
2  0.856799  2.016542 -0.206658 -0.488485
3  0.118664  0.106224 -0.669807 -0.997099
4 -0.260005 -0.378192 -0.660578  0.665457
5  0.857525  0.127473 -0.377308  0.876072
6 -0.990340 -1.661774  1.516081 -0.328640
7 -0.517959 -0.372848 -0.963749 -1.616622

In [99]:
s = df.iloc[3]

In [100]:
s

A    0.118664
B    0.106224
C   -0.669807
D   -0.997099
Name: 3, dtype: float64

In [101]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.446794 -1.072924  0.583519  0.283610
1 -0.626668 -0.545055  0.083178  1.167317
2  0.856799  2.016542 -0.206658 -0.488485
3  0.118664  0.106224 -0.669807 -0.997099
4 -0.260005 -0.378192 -0.660578  0.665457
5  0.857525  0.127473 -0.377308  0.876072
6 -0.990340 -1.661774  1.516081 -0.328640
7 -0.517959 -0.372848 -0.963749 -1.616622
8  0.118664  0.106224 -0.669807 -0.997099

In [103]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

In [104]:
df

     A      B         C         D
0  foo    one  2.529674  1.450480
1  bar    one  0.451548  0.579889
2  foo    two -0.197880 -1.112179
3  bar  three -1.168410 -0.050532
4  foo    two -0.588722 -1.345784
5  bar    two -0.062980 -0.998446
6  foo    one -0.054331 -0.651334
7  foo  three -0.539238 -0.764356

In [105]:
df.groupby('A').sum()

            C         D
A
bar -0.779842 -0.469089
foo  1.149503 -2.423173

In [106]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.451548  0.579889
    three -1.168410 -0.050532
    two   -0.062980 -0.998446
foo one    2.475343  0.799146
    three -0.539238 -0.764356
    two   -0.786603 -2.457963

In [107]:
#  https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#missing-data